In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
obj = Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3])

In [7]:
obj.keys

<bound method Series.keys of 0    4
1    7
2   -5
3    3
dtype: int64>

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
DataFrame(obj2)[1]=0

In [13]:
obj2[obj2<0]

a   -5
dtype: int64

In [14]:
7 in obj2

False

In [15]:
sdata={'a':{'a':'Bonjour','b':'Bonsoir','c':'Nous sommes à midi'},'b':'IFRI','c':'FSA','d':'EPAC','e':'MasterCard'}

In [16]:
sdata

{'a': {'a': 'Bonjour', 'b': 'Bonsoir', 'c': 'Nous sommes à midi'},
 'b': 'IFRI',
 'c': 'FSA',
 'd': 'EPAC',
 'e': 'MasterCard'}

In [17]:
dtf=DataFrame(sdata)

In [18]:
dtf['b'][1]='Licence 1'

In [19]:
dtf

                    a          b    c     d           e
a             Bonjour       IFRI  FSA  EPAC  MasterCard
b             Bonsoir  Licence 1  FSA  EPAC  MasterCard
c  Nous sommes à midi       IFRI  FSA  EPAC  MasterCard

In [20]:
dtf['b']['d']='Licence 1'

In [21]:
dtf

                    a          b    c     d           e
a             Bonjour       IFRI  FSA  EPAC  MasterCard
b             Bonsoir  Licence 1  FSA  EPAC  MasterCard
c  Nous sommes à midi       IFRI  FSA  EPAC  MasterCard

In [22]:
obj3 = Series(sdata)

In [23]:
obj3

a    {'a': 'Bonjour', 'b': 'Bonsoir', 'c': 'Nous so...
b                                                 IFRI
c                                                  FSA
d                                                 EPAC
e                                           MasterCard
dtype: object

In [24]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [25]:
obj4 = Series(sdata, index=states)

In [26]:
obj4

California    NaN
Ohio          NaN
Oregon        NaN
Texas         NaN
dtype: object

In [27]:
sdata['California']=12

In [28]:
obj4 = Series(sdata, index=states)

In [29]:
obj4

California     12
Ohio          NaN
Oregon        NaN
Texas         NaN
dtype: object

In [30]:
obj4.name = 'population'

In [31]:
obj4

California     12
Ohio          NaN
Oregon        NaN
Texas         NaN
Name: population, dtype: object

In [32]:
obj4

California     12
Ohio          NaN
Oregon        NaN
Texas         NaN
Name: population, dtype: object

In [33]:
obj4.index=['r','s','t','u']

In [34]:
obj4

r     12
s    NaN
t    NaN
u    NaN
Name: population, dtype: object

In [35]:
obj4.index

Index(['r', 's', 't', 'u'], dtype='object')

In [36]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [37]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [38]:
frame=DataFrame(data,index=['a','b','c','d','e'])

In [39]:
frame

    state  year  pop
a    Ohio  2000  1.5
b    Ohio  2001  1.7
c    Ohio  2002  3.6
d  Nevada  2001  2.4
e  Nevada  2002  2.9

In [40]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],

index=['one', 'two', 'three', 'four', 'five'])

In [41]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [42]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: pop, dtype: float64

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['debt'] = 16.5

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [46]:
frame2['debt'] = np.arange(5)

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [48]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [49]:
frame2['debt']=val

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [51]:
frame2['eastern'] = frame2.state

In [52]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    Ohio
two    2001    Ohio  1.7  -1.2    Ohio
three  2002    Ohio  3.6   NaN    Ohio
four   2001  Nevada  2.4  -1.5  Nevada
five   2002  Nevada  2.9  -1.7  Nevada

In [53]:
frame2['eastern'] = frame2.state == 'Ohio'

In [54]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [55]:
del frame2['eastern']

In [56]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [57]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},

'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [58]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [59]:
DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [60]:
frame2.T

        one   two three    four    five
year   2000  2001  2002    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9
debt    NaN  -1.2   NaN    -1.5    -1.7

In [61]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [62]:
pdata = {'Ohio': frame3['Ohio'][:-1],
'Nevada': frame3['Nevada'][:2]}

NameError: name 'frame3' is not defined

In [ ]:
frame2.values

In [ ]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [ ]:
obj

In [ ]:
obj.index

In [ ]:
frame3=frame2

In [ ]:
frame3

In [ ]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [ ]:
obj

In [ ]:
obj.reindex(['a', 'b', 'c', 'd', 'e','e','f'], fill_value=7)

In [ ]:
obj.reindex(['a'], fill_value=0)

In [ ]:
obj

In [ ]:
obj3 = Series(['blue', 'purple', 'yellow','oui'], index=np.arange(0,8,2))

In [ ]:
obj3

In [ ]:
Frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],

columns=['Ohio', 'Texas', 'California'])

In [ ]:
Frame

In [ ]:
Frame.reindex(['a','b','c','d','e'])

##REindexons le Dataframe

In [ ]:
Frame.reindex(['a','b','c','d','e'],columns=['IFRI','EPAC','ERSE'])

In [ ]:
Frame.append(['Nous sommes','Vous êtes','Voilà','presque','fin'])

In [ ]:
Frame

In [ ]:
Frame

In [ ]:
Frame.append(['Nous sommes','Vous êtes','Voilà','presque','fin'])

In [ ]:
Frame.append([2,45,'FIn'])

In [ ]:
Frame

In [ ]:
Frame

In [ ]:
Frame2.drop('a')

In [ ]:
Frame

In [ ]:
Frame.index

In [ ]:
Frame.drop('a')

In [ ]:
data = DataFrame(np.arange(16).reshape((4, 4)),

index=['Ohio', 'Colorado', 'Utah', 'New York'],

columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data['one']

In [ ]:
data['two']['Ohio']

In [ ]:
data = DataFrame(np.arange(16).reshape((4, 4)),

index=['Ohio', 'Colorado', 'Utah', 'New York'],

columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [ ]:
obj=DataFrame(obj)

In [ ]:
obj

In [ ]:
obj.reindex(np.arange(5))

In [ ]:
obj.drop('a')

In [ ]:
obj[:2]

In [ ]:
obj['a':'b']

In [ ]:
obj['d':]

In [ ]:
data

In [ ]:
data[data>=10]

In [ ]:
data

In [ ]:
data.ix[data.three > 5, :3]

In [ ]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [ ]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1+s2

In [ ]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),

index=['Ohio', 'Texas', 'Colorado'])

In [ ]:
df1

In [ ]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
df2

In [ ]:
df1+df2

In [ ]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [ ]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [ ]:
df1+df2

In [ ]:
df1.reindex(columns=df2.columns,fill_value=1)

In [ ]:
df1

In [ ]:
df1.add(df2,fill_value=2)

In [ ]:
df1.add(df2,fill_value=np.arange(4))

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.add(df2,fill_value=1)

In [ ]:
df1.sub(df2,fill_value=1)

In [ ]:
df2.div(df1,fill_value=1)

In [ ]:
mul=df1.mul(df2,fill_value=2)

In [ ]:
mul

In [ ]:
list(df2['b'])

In [ ]:
sous=df2-df2['b']

In [ ]:
sous

In [ ]:

series2 = Series(range(3), index=['b', 'e', 'f'])

In [ ]:
series2

In [ ]:
frame

In [ ]:
frame-series2

In [ ]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [ ]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
frame-series2

In [ ]:
frame+series2

In [ ]:
series3=frame['d']

In [ ]:
series3

In [ ]:
frame

In [ ]:
frame.sub(series3,axis=0)

In [ ]:
frame.add(series3,axis=0)

In [ ]:
frame.div(series3,axis=0)

In [ ]:
frame.mul(series3,axis=0)

In [ ]:
frame=DataFrame(np.random.randn(4,3),columns=list('ade'),index=['Utah','Ohio','Texas','Oregon'])

In [ ]:
frame

In [ ]:
f = C x: x.max() - x.min()

In [ ]:
!C??

In [ ]:
!lambda?all

In [ ]:
!lambda

In [ ]:
f

In [ ]:
frame.apply(f)

In [ ]:
da=DataFrame(np.arange(1,10).reshape(3,3),index=list('abc'),columns=['c1','c2','c3'])

In [ ]:
da

In [ ]:
def f(x):
    return Series([x.min(),x.max()], index=['min', 'max'])

In [ ]:
da.apply(f)

In [ ]:
format = lambda x: '%.2f' % x

In [ ]:
frame

In [ ]:
frame.applymap(format)

In [ ]:
frame['d'].map(format)

## Sorting and Ranking

In [ ]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],

columns=['d', 'a', 'b', 'c'])

In [ ]:
frame.sort_index()

In [ ]:
frame

In [ ]:
frame

In [ ]:
frame.sort_index()

In [ ]:
frame['d'].order()

In [ ]:
frame.sort_index()

frame

In [ ]:
frame.sort_index(axis=1)

In [ ]:
frame.sort_index(axis=0)

## Trie par Ordre  decroissant selon l'axe des ordonées

In [ ]:
frame.sort_index(axis=1,ascending=False)

## Trie par Ordre decroissant selon l'axe des abscisses

In [ ]:
frame.sort_index(axis=0,ascending=False)

In [ ]:
obj = Series([4, 7, -3, 2])

In [ ]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [ ]:
obj.order()

## <font color='red'>ICi ça ne marche pas !! Pourquoi ?? </font>

In [ ]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [ ]:
frame

In [ ]:
frame.sort_index(by='b')

In [ ]:
frame.sort_index(by=['a', 'b'])

In [ ]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [ ]:
obj

In [ ]:
obj.rank()

In [ ]:
obj.rank(method='first')

In [ ]:
obj.rank()

In [ ]:
frame

In [ ]:
import pandas as pd

In [ ]:
from pandas import Series, DataFrame

In [ ]:
frame2

In [63]:
frame

    state  year  pop
a    Ohio  2000  1.5
b    Ohio  2001  1.7
c    Ohio  2002  3.6
d  Nevada  2001  2.4
e  Nevada  2002  2.9

In [66]:
frame.reindex(['a','f','t','y','p'])

  state    year  pop
a  Ohio  2000.0  1.5
f   NaN     NaN  NaN
t   NaN     NaN  NaN
y   NaN     NaN  NaN
p   NaN     NaN  NaN

In [68]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [69]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [70]:
frame.sort_index(by='b')

TypeError: sort_index() got an unexpected keyword argument 'by'

In [71]:
frame.sort_index(by=['a', 'b'])

TypeError: sort_index() got an unexpected keyword argument 'by'

In [72]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [73]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [74]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [75]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],

'c': [-2, 5, 8, -2.5]})

In [76]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [77]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [78]:
frame['e'].map(format)

KeyError: 'e'

In [79]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [80]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [81]:
frame.sort_index(axis=1, ascending=False)

     c    b  a
0 -2.0  4.3  0
1  5.0  7.0  1
2  8.0 -3.0  0
3 -2.5  2.0  1

In [82]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],

[np.nan, np.nan], [0.75, -1.3]],

index=['a', 'b', 'c', 'd'],
columns=['one', 'two'])

In [83]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [84]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [85]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [86]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [87]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [88]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [89]:
df.index=['t','g','b','i']

In [90]:
df

    one  two
t  1.40  NaN
g  7.10 -4.5
b   NaN  NaN
i  0.75 -1.3

In [92]:
df.idxmin()

one    i
two    g
dtype: object

In [93]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [94]:
obj.reindex??

In [95]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [96]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [98]:
df1=frame

In [99]:
df1

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [101]:
df2=df1

In [102]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [103]:
df2.drop('b')

KeyError: "['b'] not found in axis"

In [105]:
del df2['b']

In [106]:
df2

           d     e
Utah     1.0   2.0
Ohio     4.0   5.0
Texas    7.0   8.0
Oregon  10.0  11.0

In [108]:
df2.reindex(columns=df1.columns, fill_value=0)

           d     e
Utah     1.0   2.0
Ohio     4.0   5.0
Texas    7.0   8.0
Oregon  10.0  11.0

In [109]:
df2

           d     e
Utah     1.0   2.0
Ohio     4.0   5.0
Texas    7.0   8.0
Oregon  10.0  11.0

In [110]:
df2['d']

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [111]:
df2

           d     e
Utah     1.0   2.0
Ohio     4.0   5.0
Texas    7.0   8.0
Oregon  10.0  11.0

In [112]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [113]:
obj.drop('c')

d    0
a    1
b    2
dtype: int64

In [114]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [115]:
obj.drop(['a','b'])

d    0
c    3
dtype: int64

In [116]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [117]:
data = DataFrame(np.arange(16).reshape((4, 4)),

index=['Ohio', 'Colorado', 'Utah', 'New York'],

columns=['one', 'two', 'three', 'four'])

In [118]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

KeyError: "['Utah'] not found in axis"

In [125]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [128]:
obj[1]

1.0

In [129]:
obj['b']

1.0

In [130]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [131]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [132]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
data[data['three']]

KeyError: "None of [Int64Index([2, 6, 10, 14], dtype='int64')] are in the [columns]"

In [134]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [135]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [140]:
data.loc?

In [149]:
 data.loc['Utah','one']=-9

In [150]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah       -9    9     10    11
New York   12   13     14    15

In [157]:
data.iloc[1]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [158]:
data.loc[['Colorado'],['two','three']]

          two  three
Colorado    5      6

In [162]:
data.iloc[[1],[1,2,3
              ]]

          two  three  four
Colorado    5      6     7

In [164]:
data.iloc[[2]]

      one  two  three  four
Utah   -9    9     10    11

In [172]:
data.loc[:'Utah', ['two']]

          two
Ohio        1
Colorado    5
Utah        9

In [176]:
data.loc[data.three>5,:'three']

          one  two  three
Colorado    4    5      6
Utah       -9    9     10
New York   12   13     14

KeyError: 3

In [180]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [181]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [182]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [183]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [184]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [185]:
s3=s1+s2

In [186]:
s3

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [196]:
s3.fillna(7,inplace=True)

In [197]:
s3

a    5.2
c    1.1
d    7.0
e    0.0
f    7.0
g    7.0
dtype: float64

## <font color='red'>s3.fillna(7,inplace=True)</font>

In [198]:
s3.fillna(7,inplace=True)

In [199]:
f1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),

index=['Ohio', 'Texas', 'Colorado'])

In [200]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [210]:
df3=(df1+df2)

In [211]:
df3

         b     d     e
Utah   NaN   2.0   4.0
Ohio   NaN   8.0  10.0
Texas  NaN  14.0  16.0
Oregon NaN  20.0  22.0

In [215]:
df3.fillna(4,inplace=True)

In [216]:
df3

          b     d     e
Utah    4.0   2.0   4.0
Ohio    4.0   8.0  10.0
Texas   4.0  14.0  16.0
Oregon  4.0  20.0  22.0

In [217]:
import string

In [218]:
string.ascii_letters

'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'

import string

In [219]:
string.ascii_uppercase

'ABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [220]:
df1+df2

         b     d     e
Utah   NaN   2.0   4.0
Ohio   NaN   8.0  10.0
Texas  NaN  14.0  16.0
Oregon NaN  20.0  22.0

In [223]:
f1.reindex(columns=df2.columns, fill_value=0)

            b    d  e
Ohio      0.0  2.0  0
Texas     3.0  5.0  0
Colorado  6.0  8.0  0

In [224]:
arr = np.arange(12.).reshape((3, 4))

In [225]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [226]:
DataFrame(arr)

     0    1     2     3
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [227]:
arr[0]

array([0., 1., 2., 3.])

In [228]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [229]:
arr-[5]

array([[-5., -4., -3., -2.],
       [-1.,  0.,  1.,  2.],
       [ 3.,  4.,  5.,  6.]])

In [230]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [231]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [232]:
series=frame.iloc[0]

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64